WcfHarness/WcfHarness/RequestXmls/GetAuthorizationGrants.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetAuthorizationGrants xmlns="http://www.tavisca.com/Vexiere/IAuthorizationGrant/2013/01">
      <getAuthorizationGrantRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:FilterParameters/>
        <a:OwnerOrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>1</a:Id>
        </a:OwnerOrganizationIdentifier>
        <a:PagingInfo>
          <a:PageNumber>1</a:PageNumber>
          <a:PageSize>20</a:PageSize>
        </a:PagingInfo>
        <a:SortingInfo>
          <a:OrderBy i:nil="true"/>
          <a:SortDescending>false</a:SortDescending>
        </a:SortingInfo>
      </getAuthorizationGrantRequest>
    </GetAuthorizationGrants>
  </s:Body>
</s:Envelope>